const TestMeasurements = {
    'blouse': {
        '1': {
            title: 'Обхват груди',
            value: '32.5см'
        },
        '2': {
            title: 'Длина',
            value: '50.1см'
        },
        '3': {
            title: 'Рукав от горла',
            value: '15.9см'
        },
        '4': {
            title: 'Рукав от плеча',
            value: '23.1см'
        }
    },
    'dress': {
        '1': {
            title: 'Обхват груди',
            value: '32.5см'
        },
        '2': {
            title: 'Обхват талии',
            value: '50.1см'
        },
        '3': {
            title: 'Обхват бедер',
            value: '15.9см'
        },
        '4': {
            title: 'Длина',
            value: '23.1см'
        },
        '5': {
            title: 'Длина от горла',
            value: '23.1см'
        },
        '6': {
            title: 'Рукав от плеча',
            value: '23.1см'
        }
    },
    'dresssleeveless': {
        '1': {
            title: 'Обхват груди',
            value: '32.5см'
        },
        '2': {
            title: 'Обхват талии',
            value: '50.1см'
        },
        '3': {
            title: 'Обхват бедер',
            value: '15.9см'
        },
        '4': {
            title: 'Длина',
            value: '23.1см'
        },
        '5': {
            title: 'Длина брютельки',
            value: '23.1см'
        }
    },
    'tshirt': {
        '1': {
            title: 'Обхват груди',
            value: '32.5см'
        },
        '2': {
            title: 'Длина',
            value: '50.1см'
        },
        '3': {
            title: 'Рукав от горла',
            value: '15.9см'
        },
        '4': {
            title: 'Рукав от плеча',
            value: '23.1см'
        }
    },
    'tanktop': {
        '1': {
            title: 'Обхват груди',
            value: '32.5см'
        },
        '2': {
            title: 'Длина',
            value: '50.1см'
        },
        '3': {
            title: 'Длина брютельки',
            value: '15.9см'
        }
    },
    'skirt': {
        '1': {
            title: 'Обхват талии',
            value: '32.5см'
        },
        '2': {
            title: 'Обхват бедер',
            value: '50.1см'
        },
        '3': {
            title: 'Длина справа',
            value: '15.9см'
        },
        '4': {
            title: 'Длина слева',
            value: '23.1см'
        }
    },
    'shorts': {
        '1': {
            title: 'Обхват талии',
            value: '32.5см'
        },
        '2': {
            title: 'Обхват бедер',
            value: '50.1см'
        },
        '3': {
            title: 'Высота',
            value: '15.9см'
        },
        '4': {
            title: 'Внешняя длина',
            value: '23.1см'
        },
        '5': {
            title: 'Длина внутри',
            value: '23.1см'
        },
        '6': {
            title: 'Обхват бедра',
            value: '23.1см'
        }
    },
    'pants': {
        '1': {
            title: 'Обхват талии',
            value: '32.5см'
        },
        '2': {
            title: 'Обхват бедер',
            value: '50.1см'
        },
        '3': {
            title: 'Высота',
            value: '15.9см'
        },
        '4': {
            title: 'Длина внутри',
            value: '23.1см'
        },
        '5': {
            title: 'Внешняя длина',
            value: '23.1см'
        },
        '6': {
            title: 'Обхват бедра',
            value: '23.1см'
        },
        '7': {
            title: 'Обхват колена',
            value: '23.1см'
        }
    }
};

export default TestMeasurements;
