import React, { Component } from 'react';

const MAX_NUMBER_OF_MEASUREMENTS = 6;

// Measurements:
// 1 - Обхват груди
// 2 - Обхват талии
// 3 - Обхват бедер
// 4 - Длина
// 5 - Длина от горла
// 6 - Рукав от плеча

const EMPTY_HOVER_TEXT = ' ';

class SketchDress extends Component {
    constructor(props) {
        super(props);

        this.state = {
            hoveredArrow: 0 // no arrow hovered in the beginning
        }

        this.generateLabels();

        this.handleMouseEnter = this.handleMouseEnter.bind(this);
    }

    isHovered(i) {
        return (this.state.hoveredArrow === i ?  true : false);
    }

    isHidden(i) {
        return (this.labels[i] ? false : true);
    }

    handleMouseEnter(n) {
        return (e) => {
            // n - number of the arrow
            e.stopPropagation();

            this.setState({
                hoveredArrow: n
            });

            let text = (n == 0 ? EMPTY_HOVER_TEXT : this.props.measurements[n].title);

            this.props.handleHoverArrow(text);
        };
    }

    generateLabels() {
        let m = this.props.measurements;
        let labels = [];

        for (let i = 1; i <= MAX_NUMBER_OF_MEASUREMENTS; i++) {
            if (m[i]) {
                labels[i] = m[i].value;
            } else {
                labels[i] = null
            }
        }

        this.labels = labels;
    }

    getArrowProps(i) {
        return {
            className: (this.isHovered(i) ? 'hovered' : '') + ' ' + (this.isHidden(i) ? 'hidden' : ''),
            onMouseEnter: this.handleMouseEnter(i)
        };
    }

    render() {
        let labels = this.labels;

        return (
            <svg onMouseLeave={this.handleMouseEnter(0)} width="300px" height="300px" viewBox="0 0 300 300" version="1.1">
                <g id="Sketches" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                    <g id="Dress">
                        <g onMouseEnter={this.handleMouseEnter(0)} id="MainShape" transform="translate(35.000000, 21.000000)">
                            <path d="M115,257 C115.166617,257 115.333286,256.999694 115.5,256.999085 C115.666714,256.999694 115.833383,257 116,257 C148.703098,256.758938 183,245 183,245 C181,170 162,147 162,117 C162,97.5216417 164.845548,79.6241437 170.536645,63.3075057 C170.664496,62.9409509 181.152281,71.1717824 202,88 L231,61 C207.946971,38.5355696 192.771018,23.5930907 179,13 C170.333333,6.33333333 159.666667,2 147,0 C138.8512,7.89781545 128.3512,11.8971628 115.5,11.9980422 C102.6488,11.8971628 92.1487999,7.89781545 84,0 C71.3333333,2 60.6666667,6.33333333 52,13 C38.228982,23.5930907 23.0530291,38.5355696 0,61 L29,88 C49.847719,71.1717824 60.3355041,62.9409509 60.4633551,63.3075057 C66.1544517,79.6241437 69,97.5216417 69,117 C69,147 50,170 48,245 C48,245 82.2969017,256.758938 115,256.996356 L115,257 Z" stroke="#93969E" stroke-width="2" fill="#F4F4F5" stroke-linecap="round" stroke-linejoin="round"></path>
                            <g id="Decorations" transform="translate(47.000000, 189.208122)">
                                <path d="M98.5403263,0.278851295 C102.288759,21.7695977 105.980349,41.418416 105.980349,63.7453069" id="Decoration-2" stroke="#93969E" stroke-width="2" fill="#F4F4F5" stroke-linecap="round" stroke-linejoin="round"></path>
                                <path d="M31.5403263,0.278851295 C35.2887589,21.7695977 38.9803493,41.418416 38.9803493,63.7453069" id="Decoration-1" stroke="#93969E" stroke-width="2" fill="#F4F4F5" stroke-linecap="round" stroke-linejoin="round" transform="translate(35.260338, 32.012079) scale(-1, 1) translate(-35.260338, -32.012079) "></path>
                                <path d="M135.202727,49.0127392 C135.150924,49.0358938 135.042739,49.0832425 134.879406,49.153175 C134.603452,49.2713269 134.274808,49.4088452 133.894707,49.5641197 C132.804106,50.0096393 131.522429,50.5068839 130.059543,51.0429767 C125.871931,52.5775795 121.077496,54.1132738 115.755263,55.5471396 C100.66753,59.6119337 84.4238318,62.06525 67.6441579,62.1037746 C50.6967577,62.0652459 34.3416137,59.6117802 19.191701,55.5468179 C13.8477675,54.1129556 9.0394563,52.5772857 4.84421619,51.042726 C3.37870923,50.5066642 2.0953871,50.0094555 1.00392154,49.5639764 C0.840574023,49.4942113 0.606748566,55.6313735 1,55.7918782 C2.1189226,56.2485638 2.51921482,56.786478 4.01335632,57.3330139 C8.27425471,58.8915905 13.1508127,60.4490569 18.5663135,61.9021218 C33.9077169,66.0184642 50.4673146,68.5026003 67.6441858,68.541638 C84.6546,68.5025962 101.103349,66.0183106 116.383043,61.9018001 C121.776528,60.4487387 126.638859,58.8912967 130.891772,57.3327632 C132.38307,56.7862583 133.692534,56.2782336 134.810369,55.8215885 C135.203221,55.6611053 135.544481,55.5183081 135.832924,55.3948088 C136.008229,55.3197505 135.842282,48.7268774 135.202727,49.0127392 Z" id="Decoration-3" fill="#93969E" fill-rule="nonzero" opacity="0.5"></path>
                            </g>
                        </g>
                        <g {...this.getArrowProps(4)} id="Arrow-4" transform="translate(96.000000, 32.000000)">
                            <polygon id="HoverArea" fill-opacity="0.1" fill="#FF0000" points="0 193.797414 37 193.797414 37 0 73 0 73 193.797414 109 193.797414 109 233.577586 71 233.577586 71 247 35 247 35 233.577586 0 233.577586"></polygon>
                            <path d="M-62.1340129,125.09798 L171.904157,125.09798" id="Path" stroke="#9ED0FB" stroke-width="2" transform="translate(54.500000, 124.597980) rotate(-270.000000) translate(-54.500000, -124.597980) "></path>
                            <path d="M51.833331,239.202673 C51.3741163,238.890788 51.0018492,239.08526 51.0018492,239.644756 L51.0018492,246.407872 C51.0018492,246.963913 51.3677529,247.166162 51.833331,246.849956 L56.6317254,243.591031 C57.0909402,243.279147 57.0973036,242.777803 56.6317254,242.461597 L51.833331,239.202673 Z" id="ArrowHead-2" fill="#008AF3" transform="translate(54.000121, 243.026207) rotate(-270.000000) translate(-54.000121, -243.026207) "></path>
                            <path d="M51.8437398,1.63968371 C51.384525,1.3270569 51.0122579,1.52199203 51.0122579,2.08281932 L51.0122579,8.86202571 C51.0122579,9.41938956 51.3781616,9.62212023 51.8437398,9.30516132 L56.6421342,6.03848342 C57.1013489,5.72585661 57.1077123,5.22332052 56.6421342,4.90636161 L51.8437398,1.63968371 Z" id="ArrowHead--1" fill="#008AF3" transform="translate(54.000597, 5.473019) scale(-1, -1) rotate(-270.000000) translate(-54.000597, -5.473019) "></path>
                            <rect id="LabelBackground" fill="#F4F4F5" x="25" y="198" width="58" height="30"></rect>
                            <text id="Label" font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="54" y="219">{labels[4]}</tspan>
                            </text>
                        </g>
                        <g {...this.getArrowProps(3)} id="Arrow-3" transform="translate(176.500000, 205.000000) rotate(-360.000000) translate(-176.500000, -205.000000) translate(85.000000, 184.000000)">
                            <rect id="HoverArea" fill-opacity="0.1" fill="#FF0000" x="0" y="1.42108547e-14" width="183" height="42"></rect>
                            <path d="M4,22.1 C4,29.2797017 31.3106303,35.1 65,35.1 L65,35.1 C98.6893697,35.1 126,29.2797017 126,22.1" id="Path--Front" stroke="#9ED0FB" stroke-width="2"></path>
                            <path d="M126,22.1 C126,14.9202983 98.6893697,9.1 65,9.1 C31.3106303,9.1 4,14.9202983 4,22.1" id="Path--Back" stroke="#9ED0FB" stroke-width="2" stroke-linecap="round" stroke-dasharray="5,15"></path>
                            <path d="M18.7198467,27.2791696 C18.260632,26.9665428 17.8883649,27.1614779 17.8883649,27.7223052 L17.8883649,34.5015116 C17.8883649,35.0588754 18.2542686,35.2616061 18.7198467,34.9446472 L23.5182411,31.6779693 C23.9774559,31.3653425 23.9838193,30.8628064 23.5182411,30.5458475 L18.7198467,27.2791696 Z" id="ArrowHead--Front" fill="#008AF3" transform="translate(20.888365, 31.112985) scale(-1, 1) rotate(-18.000000) translate(-20.888365, -31.112985) "></path>
                            <path d="M109.719847,10.2791696 C109.260632,9.96654278 108.888365,10.1614779 108.888365,10.7223052 L108.888365,17.5015116 C108.888365,18.0588754 109.254269,18.2616061 109.719847,17.9446472 L114.518241,14.6779693 C114.977456,14.3653425 114.983819,13.8628064 114.518241,13.5458475 L109.719847,10.2791696 Z" id="ArrowHead--Back" fill="#008AF3" transform="translate(111.888365, 14.112985) scale(1, -1) rotate(-14.000000) translate(-111.888365, -14.112985) "></path>
                            <text id="Label" className='anchorLeft' font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="134" y="26">{labels[3]}</tspan>
                            </text>
                        </g>
                        <g {...this.getArrowProps(2)} id="Arrow-2" transform="translate(168.500000, 147.000000) rotate(-360.000000) translate(-168.500000, -147.000000) translate(85.000000, 124.000000)">
                            <rect id="HoverArea" fill-opacity="0.1" fill="#FF0000" x="0" y="1.42108547e-14" width="167" height="46"></rect>
                            <path d="M18.8427734,22.1 C18.8427734,29.2797017 39.787999,35.1 65.6252441,35.1 L65.6252441,35.1 C91.4624893,35.1 112.407715,29.2797017 112.407715,22.1" id="Path--Front" stroke="#9ED0FB" stroke-width="2"></path>
                            <path d="M112.407715,22.1 C112.407715,14.9202983 91.4624893,9.1 65.6252441,9.1 C39.787999,9.1 18.8427734,14.9202983 18.8427734,22.1" id="Path--Back" stroke="#9ED0FB" stroke-width="2" stroke-linecap="round" stroke-dasharray="5,15"></path>
                            <path d="M29.7198467,27.2791696 C29.260632,26.9665428 28.8883649,27.1614779 28.8883649,27.7223052 L28.8883649,34.5015116 C28.8883649,35.0588754 29.2542686,35.2616061 29.7198467,34.9446472 L34.5182411,31.6779693 C34.9774559,31.3653425 34.9838193,30.8628064 34.5182411,30.5458475 L29.7198467,27.2791696 Z" id="ArrowHead--Front" fill="#008AF3" transform="translate(31.888365, 31.112985) scale(-1, 1) rotate(-18.000000) translate(-31.888365, -31.112985) "></path>
                            <path d="M95.7198467,9.27916958 C95.260632,8.96654278 94.8883649,9.16147791 94.8883649,9.72230519 L94.8883649,16.5015116 C94.8883649,17.0588754 95.2542686,17.2616061 95.7198467,16.9446472 L100.518241,13.6779693 C100.977456,13.3653425 100.983819,12.8628064 100.518241,12.5458475 L95.7198467,9.27916958 Z" id="ArrowHead--Back" fill="#008AF3" transform="translate(97.888365, 13.112985) scale(1, -1) rotate(-14.000000) translate(-97.888365, -13.112985) "></path>
                            <text id="Label" className='anchorLeft' font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="120" y="27">{labels[2]}</tspan>
                            </text>
                        </g>
                        <g {...this.getArrowProps(1)} id="Arrow-1" transform="translate(150.000000, 90.000000) rotate(-360.000000) translate(-150.000000, -90.000000) translate(85.000000, 65.000000)">
                            <rect id="HoverArea" fill-opacity="0.1" fill="#FF0000" x="0" y="1.42108547e-14" width="130" height="50"></rect>
                            <path d="M11.3325195,22.1 C11.3325195,29.2797017 35.360269,35.1 65,35.1 L65,35.1 C94.639731,35.1 118.66748,29.2797017 118.66748,22.1" id="Path--Front" stroke="#9ED0FB" stroke-width="2"></path>
                            <path d="M118.66748,22.1 C118.66748,14.9202983 94.639731,9.1 65,9.1 C35.360269,9.1 11.3325195,14.9202983 11.3325195,22.1" id="Path--Back" stroke="#9ED0FB" stroke-width="2" stroke-linecap="round" stroke-dasharray="5,15"></path>
                            <path d="M23.7198467,27.2791696 C23.260632,26.9665428 22.8883649,27.1614779 22.8883649,27.7223052 L22.8883649,34.5015116 C22.8883649,35.0588754 23.2542686,35.2616061 23.7198467,34.9446472 L28.5182411,31.6779693 C28.9774559,31.3653425 28.9838193,30.8628064 28.5182411,30.5458475 L23.7198467,27.2791696 Z" id="ArrowHead--Front" fill="#008AF3" transform="translate(25.888365, 31.112985) scale(-1, 1) rotate(-18.000000) translate(-25.888365, -31.112985) "></path>
                            <path d="M101.719847,9.27916958 C101.260632,8.96654278 100.888365,9.16147791 100.888365,9.72230519 L100.888365,16.5015116 C100.888365,17.0588754 101.254269,17.2616061 101.719847,16.9446472 L106.518241,13.6779693 C106.977456,13.3653425 106.983819,12.8628064 106.518241,12.5458475 L101.719847,9.27916958 Z" id="ArrowHead--Back" fill="#008AF3" transform="translate(103.888365, 13.112985) scale(1, -1) rotate(-14.000000) translate(-103.888365, -13.112985) "></path>
                            <rect id="LabelBackground" fill="#F4F4F5" x="36" y="20" width="59" height="30"></rect>
                            <text id="Label" font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="65" y="41">{labels[1]}</tspan>
                            </text>
                        </g>
                        <g {...this.getArrowProps(6)} id="Arrow-6" transform="translate(202.000000, 13.000000)">
                            <polygon id="HoverArea" fill-opacity="0.1" fill="#FD0000" points="6 0 34 0 87 28 90 70 67 78 0 26"></polygon>
                            <path d="M2.66978721,40.4748737 C15.0471741,38.470874 78.3302128,35.5251263 78.3302128,35.5251263" id="Path" stroke="#9ED0FB" stroke-width="2" transform="translate(40.500000, 38.000000) rotate(45.000000) translate(-40.500000, -38.000000) "></path>
                            <path d="M65.7695301,58.9770891 C65.3103153,58.6644623 64.9380482,58.8593974 64.9380482,59.4202247 L64.9380482,66.1994311 C64.9380482,66.7567949 65.3039519,66.9595256 65.7695301,66.6425667 L70.5679244,63.3758888 C71.0271392,63.063262 71.0335026,62.5607259 70.5679244,62.243767 L65.7695301,58.9770891 Z" id="ArrowHead-2" fill="#008AF3" transform="translate(67.938048, 62.810904) rotate(45.000000) translate(-67.938048, -62.810904) "></path>
                            <path d="M11.3909693,9.59852835 C10.9317546,9.28590155 10.5594875,9.48083668 10.5594875,10.041664 L10.5594875,16.8208704 C10.5594875,17.3782342 10.9253912,17.5809649 11.3909693,17.264006 L16.1893637,13.9973281 C16.6485785,13.6847013 16.6549419,13.1821652 16.1893637,12.8652063 L11.3909693,9.59852835 Z" id="ArrowHead-1" fill="#008AF3" transform="translate(13.559487, 13.432343) scale(-1, 1) rotate(-45.000000) translate(-13.559487, -13.432343) "></path>
                            <text id="Label" transform="translate(64.920310, 39.920310) rotate(41.000000) translate(-64.920310, -39.920310) " font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="43.4203102" y="45.4203102">{labels[6]}</tspan>
                            </text>
                        </g>
                        <g {...this.getArrowProps(5)} id="Arrow-5" transform="translate(22.000000, -15.000000)">
                            <path d="M0,63 C16.0578032,42.4964299 31.7244699,29.8297632 47,25 C62.2755301,20.1702368 89.9421968,18.5035701 130,20 L130,54 C104.943402,55.2509764 86.9434023,58.2509764 76,63 C65.0565977,67.7490236 47.7232644,80.082357 24,100 L0,100 L0,63 Z" id="HoverArea" fill-opacity="0.1" fill="#FF0000"></path>
                            <path d="M5.5451937,80.7224415 L24.958755,61.3088802 L24.9587551,61.3088803 C28.6978104,57.569825 32.899839,54.3244641 37.4625202,51.6518233 C45.3068143,47.0569413 52.3453751,44.2549276 58.5782023,43.2457821 C66.6489757,41.9390582 90.9527809,40.3320253 131.489618,38.4246833" id="Path" stroke="#9ED0FB" stroke-width="2" transform="translate(68.517406, 59.573562) scale(-1, 1) rotate(45.000000) translate(-68.517406, -59.573562) "></path>
                            <path d="M6.48298779,85.8973406 C6.02377303,85.5847138 5.65150592,85.7796489 5.65150592,86.3404762 L5.65150592,93.1196826 C5.65150592,93.6770465 6.01740965,93.8797771 6.48298779,93.5628182 L11.2813822,90.2961403 C11.7405969,89.9835135 11.7469603,89.4809774 11.2813822,89.1640185 L6.48298779,85.8973406 Z" id="ArrowHead-1" fill="#008AF3" transform="translate(8.651506, 89.731156) scale(-1, 1) rotate(45.000000) translate(-8.651506, -89.731156) "></path>
                            <path d="M124.642771,26.3203645 C124.183556,26.0077377 123.811289,26.2026729 123.811289,26.7635001 L123.811289,33.5427065 C123.811289,34.1000704 124.177192,34.3028011 124.642771,33.9858421 L129.441165,30.7191642 C129.90038,30.4065374 129.906743,29.9040013 129.441165,29.5870424 L124.642771,26.3203645 Z" id="ArrowHead-2" fill="#008AF3"></path>
                            <text id="Label" transform="translate(50.100439, 34.631492) rotate(-41.000000) translate(-50.100439, -34.631492) " font-family="RobotoMono-Bold, Roboto Mono" font-size="14" font-weight="bold" fill="#008AF3">
                                <tspan x="28.6004388" y="40.1314917">{labels[5]}</tspan>
                            </text>
                        </g>
                    </g>
                </g>
            </svg>
        )
    }
}

export default SketchDress;
